Revit 2027 API
RebarShapeConstraintFixedSegmentDir Properties
The RebarShapeConstraintFixedSegmentDir type exposes the following members.
Properties
Name | Description
Direction |  The direction of the RebarShapeSegment in UV-space.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RebarShapeConstraint)
Top
See Also
Reference
RebarShapeConstraintFixedSegmentDir Class
Autodesk.Revit.DB.Structure Namespace